## Exercises I

In [1]:
import pandas as pd
import numpy as np
import env

Use your function to obtain a connection to the employees database.

In [4]:
pd.read_sql('SELECT * FROM employees LIMIT 5', env.get_db_url('employees'))

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

a. Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
# There is an access denied message becasue of the mispelled db name
pd.read_sql('SELECT * FROM employees LIMIT 5', env.get_db_url('employes'))

b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
# it says I have an error in my sql syntax
pd.read_sql('SELECT * FROM employees LMIT 5', env.get_db_url('employees'))

Read the employees and titles tables into two separate DataFrames.

In [10]:
emp_df = pd.read_sql('SELECT * FROM employees', env.get_db_url('employees'))

In [12]:
titles_df = pd.read_sql('SELECT * FROM titles', env.get_db_url('employees'))

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [13]:
emp_df.shape

(300024, 6)

In [14]:
titles_df.shape

(443308, 4)

Display the summary statistics for each DataFrame.

In [44]:
emp_df.describe(), emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

(              emp_no
 count  300024.000000
 mean   253321.763392
 std    161828.235540
 min     10001.000000
 25%     85006.750000
 50%    249987.500000
 75%    424993.250000
 max    499999.000000,
 None)

In [45]:
titles_df.info(), titles_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

(None,
               emp_no
 count  443308.000000
 mean   253075.034430
 std    161853.292613
 min     10001.000000
 25%     84855.750000
 50%    249847.500000
 75%    424891.250000
 max    499999.000000)

How many unique titles are in the titles DataFrame?

In [21]:
len(titles_df.title.unique())

7

In [38]:
len(titles_df.title.value_counts())

7

What is the oldest date in the to_date column?

In [24]:
titles_df.to_date.min()

datetime.date(1985, 3, 1)

What is the most recent date in the to_date column?

In [36]:
# including currrently employed
titles_df.to_date.max()

datetime.date(9999, 1, 1)

In [35]:
# excluding currently employed people
titles_df.to_date[titles_df.to_date != titles_df.to_date.max()].max()

datetime.date(2002, 8, 1)

## Exercises II

Copy the users and roles DataFrames from the examples above.

In [2]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

What is the result of using a right join on the DataFrames?

In [5]:
#roles = roles.rename(columns={'id':'role_id', 'name':'role'})
pd.merge(users, roles, how='right', on='role_id')

    id   name  role_id       role
0  1.0    bob      1.0      admin
1  2.0    joe      2.0     author
2  3.0  sally      3.0   reviewer
3  4.0   adam      3.0   reviewer
4  NaN    NaN      4.0  commenter

What is the result of using an outer join on the DataFrames?

In [6]:
pd.merge(users, roles, how='outer', on='role_id')

    id   name  role_id       role
0  1.0    bob      1.0      admin
1  2.0    joe      2.0     author
2  3.0  sally      3.0   reviewer
3  4.0   adam      3.0   reviewer
4  5.0   jane      NaN        NaN
5  6.0   mike      NaN        NaN
6  NaN    NaN      4.0  commenter

What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
# if you drop the foreign keys there is no way to correctly merge to roles with the users. If you try to merge with the users 'id' there is no relationship between the users 'id' and the roles 'id'

Load the mpg dataset from PyDataset.

In [10]:
from pydataset import data
mpg = data('mpg')

Output and read the documentation for the mpg dataset.

In [11]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

How many rows and columns are in the dataset?

In [12]:
mpg.shape

(234, 11)

Check out your column names and perform any cleanup you may want on them.

In [22]:
## change drv to drive
## change displ to displacement
# mpg = mpg.rename(columns={'drv':'drive', 'displ':'displacement', 'cyl':'cylinders'})

Display the summary statistics for the dataset.

In [23]:
mpg.describe()

       displacement         year   cylinders         cty         hwy
count    234.000000   234.000000  234.000000  234.000000  234.000000
mean       3.471795  2003.500000    5.888889   16.858974   23.440171
std        1.291959     4.509646    1.611534    4.255946    5.954643
min        1.600000  1999.000000    4.000000    9.000000   12.000000
25%        2.400000  1999.000000    4.000000   14.000000   18.000000
50%        3.300000  2003.500000    6.000000   17.000000   24.000000
75%        4.600000  2008.000000    8.000000   19.000000   27.000000
max        7.000000  2008.000000    8.000000   35.000000   44.000000

How many different manufacturers are there?

In [24]:
mpg.manufacturer.nunique()

15

How many different models are there?

In [25]:
mpg.model.nunique()

38

Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [27]:
#mpg['mileage_diff'] = mpg.hwy - mpg.cty
mpg

,manufacturer,model,displacement,year,cylinders,trans,drive,cty,hwy,fl,class,mileage_diff
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [45]:
# mpg['avg_mileage'] = mpg[['cty', 'hwy']].agg('mean', axis=1)

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [38]:
#mpg['is_automatic'] = mpg.trans.apply(lambda x:'auto' in x)
mpg[['trans', 'is_automatic']]

          trans  is_automatic
1      auto(l5)          True
2    manual(m5)         False
3    manual(m6)         False
4      auto(av)          True
5      auto(l5)          True
..          ...           ...
230    auto(s6)          True
231  manual(m6)         False
232    auto(l5)          True
233  manual(m5)         False
234    auto(s6)          True

[234 rows x 2 columns]

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [51]:
mpg['avg_mileage'].groupby(mpg.manufacturer).agg('mean').nlargest(1)

manufacturer
honda    28.5
Name: avg_mileage, dtype: float64

Do automatic or manual cars have better miles per gallon?

In [52]:
mpg['avg_mileage'].groupby(mpg.is_automatic).agg('mean')

is_automatic
False    22.227273
True     19.130573
Name: avg_mileage, dtype: float64

## Exercises III

Use your get_db_url function to help you explore the data from the chipotle database.

What is the total price for each order?

What are the most popular 3 items?

Which item has produced the most revenue?

Join the employees and titles DataFrames together.

For each title, find the hire date of the employee that was hired most recently with that title.

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)